app/controllers/appointments_controller.rb

INSERT INTO "appointments" ("title", "appointment_date", "email", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdf"], ["appointment_date", "2016-09-08"], ["email", "adsf"], ["created_at", "2016-09-23 00:43:51.081913"], ["updated_at", "2016-09-23 00:43:51.081913"]]
---
  def create
    @appointment = Appointment.new(appointment_params)
    if @appointment.save

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", 24]]
UPDATE "appointments" SET "title" = ?, "email" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["title", "hello!"], ["email", "asdf"], ["updated_at", "2016-09-22 23:21:30.314472"], ["id", 24]]
---
  def update
    @appointment = Appointment.find(params[:id])
    if @appointment.update_attribute('title',appointment_params[:title]) &&
      @appointment.update_attribute('email',appointment_params[:email])

SELECT  "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 1]]
---
  def destroy
    @appointment = Appointment.find(params[:id])
    @appointment.destroy!